In [142]:
# Importing the librarie
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import pickle

In [143]:
dataset = pd.read_csv('hiring.csv')
dataset.head()

  experience  test_score  interview_score  salary
0        NaN         8.0                9   50000
1        NaN         8.0                6   45000
2       Five         6.0                7   60000
3        two        10.0               10   65000
4      seven         9.0                6   70000

In [144]:
# ############ Self written code for study to use partial columns and rows################
# study_df = pd.read_csv("hiring.csv", usecols=['experience', 'salary'], nrows=3)
# study_df.head()

In [145]:
dataset['experience'].fillna(0, inplace=True)

In [146]:
dataset.head(n=10)

  experience  test_score  interview_score  salary
0          0         8.0                9   50000
1          0         8.0                6   45000
2       Five         6.0                7   60000
3        two        10.0               10   65000
4      seven         9.0                6   70000
5      three         7.0               10   62000
6        ten         NaN                7   72000
7     eleven         7.0                8   80000

In [147]:
dataset['test_score'].fillna(dataset['test_score'].mean(), inplace=True)

In [148]:
dataset.head(n=10)

  experience  test_score  interview_score  salary
0          0    8.000000                9   50000
1          0    8.000000                6   45000
2       Five    6.000000                7   60000
3        two   10.000000               10   65000
4      seven    9.000000                6   70000
5      three    7.000000               10   62000
6        ten    7.857143                7   72000
7     eleven    7.000000                8   80000

In [149]:
X = dataset.iloc[:, :3]

In [150]:
X.head()

  experience  test_score  interview_score
0          0         8.0                9
1          0         8.0                6
2       Five         6.0                7
3        two        10.0               10
4      seven         9.0                6

In [151]:
X.experience.dtype

dtype('O')

In [152]:
X.experience.replace('Five', 'five', inplace=True)

In [153]:
X.head(10)

  experience  test_score  interview_score
0          0    8.000000                9
1          0    8.000000                6
2       five    6.000000                7
3        two   10.000000               10
4      seven    9.000000                6
5      three    7.000000               10
6        ten    7.857143                7
7     eleven    7.000000                8

In [154]:
#Converting words to integer values
def convert_to_int(word):
    word_dict = {'one':1, 'two':2, 'three':3, 'four':4, 'five':5, 'six':6, 'seven':7, 'eight':8,
                'nine':9, 'ten':10, 'eleven':11, 'twelve':12, 'zero':0, 0:0, 'o':0}
    return word_dict[word]

In [155]:
X['experience'] = X['experience'].apply(lambda x : convert_to_int(x))

In [161]:
X.head(8)

   experience  test_score  interview_score
0           0    8.000000                9
1           0    8.000000                6
2           5    6.000000                7
3           2   10.000000               10
4           7    9.000000                6
5           3    7.000000               10
6          10    7.857143                7
7          11    7.000000                8

In [156]:
y = dataset.iloc[:, -1]

In [160]:
y.head(8)

0    50000
1    45000
2    60000
3    65000
4    70000
5    62000
6    72000
7    80000
Name: salary, dtype: int64

In [162]:
#Splitting Training and Test Set
#Since we have a very small dataset, we will train our model with all availabe data.

In [163]:
from sklearn.linear_model import LinearRegression
regressor = LinearRegression()

In [164]:
#Fitting model with trainig data
regressor.fit(X, y)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [165]:
# Saving model to disk
pickle.dump(regressor, open('model.pkl','wb'))

In [166]:
# Loading model to compare the results
model = pickle.load(open('model.pkl', 'rb'))
print(model.predict([[2,9,6]]))

[53290.89255945]

In [167]:
# Loading model to compare the results
model = pickle.load(open('model.pkl', 'rb'))
print(model.predict([[0,8,6]]))

[45722.68644263]

In [168]:
# Loading model to compare the results
model = pickle.load(open('model.pkl', 'rb'))
print(model.predict([[7,9,6]]))

[67429.06277517]